#include "widget.h"
//创建完成初始状态是只有一个自定义类（该自定义类由三个基类中的某一个派生而来，该自定义类包含有两个文件）和一个
//包含了该自定义类的一个主函数，由一个为main.cpp的文件构成。

//信号与槽机制实例：下课后，老师接收到饿了的信号，发送通知信号给学生，学生接收到该通知信号后请客吃饭。
Widget::Widget(QWidget *parent): QWidget(parent)
{
    this->zt=new Teacher(this);//this指的是当前这个类所定义的对象，当前这个类是Widget，是一个窗口
    //类，则说明了this指的是当前这个窗口；zt是Teacher类的一个对象，同时指明其父亲为this，即是当前这个窗口。
    this->st=new Student(this);

    connect(zt,&Teacher::hungry,st,&Student::treat);
//饿了的信号就是通知信号，学生接收到该信号后进行treat，即是进行请客吃法的工作，老师要想发送hungry的信号给学生
//必须要有一个触发事件。


    //调用下课函数，触发老师饿了，老师将饿了的信号发送给学生
    classisover(); //这个下课函数所执行的就是信号所指示的事件，信号所指示的事件被触发发送者才会将该信号发
    //送给接收者。
}

void Widget::classisover()
{
    emit zt->hungry();//关键字emit
}
Widget::~Widget()
{
}
/*
思想：main函数中包含的头文件就是main函数所包含的类，main函数中永远只包含一个自定义的类，就是创建工程文件
时所指明的那个类（编写QT的程序时一般是这样编写的），通过添加工程文件所添加的类文件（就是所添加的类）是包含在
自定义的那个类中的，所完成的是类的组合的功能，二者是毫不相干的两个类，即一个类包含由另一个类，而不是类的继承
或者派生，要想完成类的继承或者派生，可以将通过工程文件添加的那个类指明其父亲为当前这个类。

实例：
窗口与我的按钮两个类：窗口是创建工程文件时自定义的类，也是main函数所包含的唯一一个自定义的类；我的按钮类是通过
                  工程文件添加的一个类，二者本来是毫无关系的两个类，但是为我的按钮类所定义的对象指明了其父亲
                  当前这个窗口类所定义的一个窗口，此时这个窗口就贴了一个按钮。


对某一个类所进行的操作是通过两个文件来共同完成的。
*/


