#include "widget.h"

#include <QApplication>

int main(int argc, char *argv[])
{  /*
    当父对象析构的时候，该父对象所有的子对象也将会被析构，反应到窗口中就是，当窗口这个对象释放时，窗口这个对象
    的所有子对象也都会被释放，如用户自定义窗口中贴了按钮，则按钮就是这个窗口的子对象（因为按钮贴在窗口上时是为
    这个按钮指明了父亲的，即是指明是贴在了哪个窗口的），当该窗口释放时，会先释放该按钮，然后释放该窗口。
    构造的顺序是从基类到派生类；析构的顺序是从派生类到基类。
   */

    /*在这个工程中添加新文件的方法:鼠标移动到工程文件4-Mywidget点击右键->Add New->选择C++ C++class
    (由于是C++class，选择这个创建的是C++中的一个类的文件)->自定义这个类文件的名字，选择这个类文件继承的父类
     ->点击下一步，完成。
     这样就在这个工程中创建了一个类的文件，QT中类的文件由两部分组成，一部分是是该类的.h头文件（该类的数据成员和
     成员函数的声明），另一部分是该类的.cpp源文件（里面的内容是该类在类外中成员函数的定义）。
    */

    /*
    (1)用户自定义类，其头文件名都是小写的且带.h，但是在用到该类，如用该类定义一个对象或者在类外定义该类的
       成员函数时必须与创建类文件时所写的那个类名一致。
    (2)系统提供一些类，其头文件名首字母一般都是大写的且不带.h。
    */
    QApplication a(argc, argv);
    Widget w;
    w.show();
    return a.exec();
}
