/*
************************************************************************************************************************
*                                                 包含的头文件
************************************************************************************************************************
*/
#include "os.h"
#include "ARMCM3.h"

/*
************************************************************************************************************************
*                                                   宏定义
************************************************************************************************************************
*/


/*
************************************************************************************************************************
*                                                  全局变量
************************************************************************************************************************
*/

uint32_t flag1;
uint32_t flag2;
uint32_t flag3;

/*
************************************************************************************************************************
*                                                  TCB & STACK & 任务声明
************************************************************************************************************************
*/
#define  TASK1_STK_SIZE       128
#define  TASK2_STK_SIZE       128
#define  TASK3_STK_SIZE       128


static   OS_TCB    Task1TCB;
static   OS_TCB    Task2TCB;
static   OS_TCB    Task3TCB;


static   CPU_STK   Task1Stk[TASK1_STK_SIZE];
static   CPU_STK   Task2Stk[TASK2_STK_SIZE];
static   CPU_STK   Task3Stk[TASK2_STK_SIZE];


void     Task1( void *p_arg );
void     Task2( void *p_arg );
void     Task3( void *p_arg );


/*
************************************************************************************************************************
*                                                  函数声明
************************************************************************************************************************
*/
void delay(uint32_t count);

/*
************************************************************************************************************************
*                                                    main函数
************************************************************************************************************************
*/
/*
* 注意事项：1、该工程使用软件仿真，debug需选择 Ude Simulator
*           2、在Target选项卡里面把晶振Xtal(Mhz)的值改为25，默认是12，
*              改成25是为了跟system_ARMCM3.c中定义的__SYSTEM_CLOCK相同，确保仿真的时候时钟一致
*/
int main(void)
{	
	OS_ERR err;	
	CPU_Init();	      //CPU初始化：1、初始化时间戳 
	CPU_IntDis();     //关闭中断 
	
	OS_CPU_SysTickInit (10);  //配置SysTick 10ms 中断一次 
	
	
	OSInit(&err);  //初始化相关的全局变量 
	
	/* 创建任务 */
	OSTaskCreate( (OS_TCB*)&Task1TCB, 
	              (OS_TASK_PTR )Task1, 
                  (void *)0,
				  (OS_PRIO)1,    //指明了Task1任务的优先级是为1的
				  (CPU_STK*)&Task1Stk[0],
				  (CPU_STK_SIZE)  TASK1_STK_SIZE,
				  (OS_ERR *)&err );
				  
	OSTaskCreate( (OS_TCB*)&Task2TCB, 
	              (OS_TASK_PTR )Task2, 
                  (void *)0,
				  (OS_PRIO)2,   //指明了Task2任务的优先级是为2的
				  (CPU_STK*)&Task2Stk[0],
				  (CPU_STK_SIZE)  TASK2_STK_SIZE,
				  (OS_ERR *)&err );	
				  
	OSTaskCreate( (OS_TCB*)&Task3TCB, 
	              (OS_TASK_PTR )Task3, 
                  (void *)0,
				  (OS_PRIO)3,   //指明了Task3任务的优先级是为3的
				  (CPU_STK*)&Task3Stk[0],
				  (CPU_STK_SIZE)  TASK3_STK_SIZE,
				  (OS_ERR *)&err );
 		
	//在任务创建时就会将这个任务所对应的优先级在优先级表中进行置为1，只有置位1的话在执行任务切换的时候才有可能会切换到这个任务去执行
									
	OSStart(&err);  //启动操作系统
}

/*
************************************************************************************************************************
*                                                    函数实现
************************************************************************************************************************
*/
/* 软件延时 */
void delay (uint32_t count)
{
	for(; count!=0; count--);
}



void Task1( void *p_arg )
{	
	for( ;; )
    {
		flag1 = 1;
		OSTimeDly(3);		
		flag1 = 0;
		OSTimeDly(3);		
	}
}

void Task2( void *p_arg )
{
	for( ;; )
    {
		flag2 = 1;
		OSTimeDly(2);		
		flag2 = 0;
		OSTimeDly(2);
	}
}

void Task3( void *p_arg )
{
	for( ;; )
  {
		flag3 = 1;
		OSTimeDly(1);		
		flag3 = 0;
		OSTimeDly(1);
	}
}




