#include "mainwindow.h"
#include "ui_mainwindow.h"
/*
 使用QT来进行图形界面的设计时有两种方式：
 (1)使用代码的方式来进行图形界面的设计时是在Headers（头文件）和Sources（源文件）中来进行的，是在这两个中
    来进行代码的编写并运行实现的。
 (2)使用图标拖拽的方式来进行图形界面的设计时是在Forms文件中进行的。
    使用图标拖拽的方式：
    <1>左侧的工具栏有各种图标来供你进行选择，如可以在拖拽一个按钮、中心部件、浮动窗口放到窗口中。
    <2>右侧上面的状态栏中显示了当前这个窗口中所用到的一些类和对象的情况。
    <3>窗口中所贴上的每一个东西都是一个对象，如窗口上所贴的菜单栏、菜单栏中的每一个菜单、菜单中的每一个
       菜单项、都是一个对象；如窗口上所贴的工具栏就是一个对象、窗口上所贴的状态栏、状态栏中所贴的每一个标签
       都是一个对象；窗口上所贴的浮动窗口和中心部件也都是一个对象；窗口上所贴的按钮也是一个对象。只要是对象
       就有相应的类与之对应，点击该窗口上的每一个东西时就会在窗口右下部的小方框里找到该东西对应的某一个对象
       所对应的类，找到相应的类（相应的类是灰色的团标）后点击就能看到该类所包含的所有对象所对应的各个成员函
       数（各个成员函数是浅绿色的图标），点击某一个成员函数就能对其参数进行修改就可改变某一个对象的属性。
      （颜色深一点的绿色是不是成员函数，所对应的是窗口中没有对象的东西，如菜单中的内容，工具栏中的内容，可以
       对菜单栏中的内容或者工具栏中的内容进行修改）
*/
MainWindow::MainWindow(QWidget *parent): QMainWindow(parent), ui(new Ui::MainWindow)
{
    ui->setupUi(this);
    ui->menu_3->setIcon(QIcon("D:/photo/chicken.png")); /*每一个控件都对应有一个系统随机起的名字，
    可以在设计界面中点击某一个控件来进行查看，利用ui->控件名字->相应的成员函数可以对某一个控件进行相应的ui
    设置（ui设置就是进行相应的图形设置）。如设计界面中文件菜单中“新建”的菜单项的名字为men_3,利用
    ui->men_3->就可以对“新建”这个菜单项进行相应的ui设置了，ui->men_3(setIcon("某一个图标的文件路径"))
    就是完成在“新建”这个菜单项中添加一个图标的功能。也可以利用这种方法来为某一个按钮设置某一个图标。
    */

    /*
      也是可以在这个工程文件中添加一个资源文件的
      添加资源文件的方法：
      将文件（或者文件夹，对应了多个文件）拷贝到项目位置下->右键项目，点击添加新文件（选择QT,QT resour File
      ）->资源文件起名（如res）->在该项目下生成一个资源文件（如res.qrc）

      注意：如果切换了到其他的文件，是无法通过点击鼠标的右键来直接打开该qrc的资源文件的，想要打开该.qrc资源
           文件必须鼠标移动到该.qrc文件中，点击鼠标右键，点击open in editor,这样才能打开该.qrc的资源文件。
      注意：在QT的工程中添加资源文件时所添加的资源文件是一个空文件，是需要在这个文件中加入你要添的资源的，即
           你需要在这个空文件中创建一个文件夹（一个目录），然后在该文件夹中添加你需要的问价；或者直接在这个
           空文件中添加一个带有资源文件的文件夹。

     ->打开该.qrc的资源文件->为这个.qrc的资源文件添加文件夹，往这个文件夹中添加资源文件或者添加一个带有资源
     文件的文件夹->使用时直接利用":+目录+文件名"就能找到该文件了。
    */

    //如何使用所添加的资源文件：" : + 前缀名 + 文件名 "
    ui->actionopen->setIcon(QIcon(":/photo/pony.png")); //注意：pony.png图片文件在工程的资源中是
    //两个目录文件的，这两个目录文件是都要写上的。
    ui->actionsave->setIcon(QIcon(":/photo/jellyfish.png"));

    ui->pushButton->setIcon(QIcon(":/photo/jellyfish.png")); //为什么无法对按钮添加图标？？？

    /*
     总：
     <1>可以利用在某一个磁盘中的图片路径来添加图标
     <2>可以利用在该项目工程中添加资源文件，通过该资源文件来添加图标
     <3>可以利用设计界面右下部分中的addcon来添加图标

     如果在创建工程时选择creat new form时会在所创立的工程文件中新增加一个与自定义的类名同名的一个.ui的
     文件；如果在工程中增加了一个资源文件，会在该工程中增加一个.qrc的资源文件。
    */
}

MainWindow::~MainWindow()
{
    delete ui;
}

