#include "widget.h"

#include <QApplication>

int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    Widget w;
    w.show();
    return a.exec();
}
/*
自定义封装控件(举例)：进度条（实现资源的加载，游戏主角等级的提升）。
添加文件这里有一个QT，QT这里有一个QT设计师界面类（包含了.h,.cpp，gui文件）。
*/

/*
 添加了一个QT设计师界面类的文件时相当于为这个工程增加了一个该类的.cpp、该类的.h、该类的.ui的文件，
 总共是有三个文件的。在这个类的.ui界面完成自定义控件组合的任务（即是这个自定义控件包含了有哪些控件），
 在该类的.cpp文件中利用代码来实现对自定义控件功能的设置，即是这个自定义控件中的每一个控件完成什么任务
 以及它们是如何协调工作的。

 在该类的.ui界面完成对自定义控件的组合后返回到编辑界面选择widget.ui界面（本题中是这样，当在创建项目时如
 果用户自定义类的基类是QmainWindow，则此时返回到编辑界面中选择的是QmainWindow.ui界面），即是最初始的
 那个ui界面，在这个ui界面中选择widget容器（因为在添加这个QT设计师界面类时为这个类已经指明了其继承的基类
 为QWidget，故需要包含该QWidget的头文件，在ui界面中当在一个容器中来添加控件时就相当于这个控件已经包含了
 这个容器所对应的头文件了，在widget容器中添加控件就相当于这个控价包含了QWidget这个头文件，故这个自定义的
 控件需要在widget这个容器中使用），在这个容器中鼠标右击输入提升类的名称（提升的类就是用户添加的那个QT设计
 师界面类），选择添加（全局包含可以点也可以不点，点了的话这个自定义控件就会包含在这各widget.ui的界面中了
 ,下次再需要用到它的时候鼠标右击选择提升为就可以直接看到这个控件了，前提是也要在一个wdiget的容器中），选择
 提升就能将这个 自定义控件添加到这个widget容器中了。

 注意：自定义控件是由多个系统所提供的的空间组合而来的，这个自定义控件对应了一个类，这个类包含了3个文件
      （.h、.cpp、.ui），这个类继承了一个基类，对应于代码中是包含了该类的头文件，而对应于ui界面中则是
      在这个基类容器中添加控件，由于基类的名字是不能改变的，故在ui界面中是不能修改最大的那整个界面的名字
      ，但是可以对这个ui界面中的控件进行修改名字或者再添加一个容器后对两个控件进行封装后再修改这个容器的
      名字，总之就是最大的那整个容器的名字是没有办法修改的。

 在自定义控件的类的.cpp文件的构造函数中写的代码是这个控件自带的一些功能，而在自定义控件类的.h头文件中所
 声明的成员函数（该成员函数也是需要在自定义控件类的.cpp文件中去实现的）是提供给用户操作这个控件的一些接
 口，该接口是在用户创建项目时的.cpp的文件中的构造函数中去实现的。即一个是在自定义控件类的.cpp中的构造函
 数中去写的，一个是在用户创建项目时自定义类的.cpp的构造函数中去写的，这两点要区分开。

 所谓的自定义控件就是利用系统所提供的控件组合而成的一个控件。
*/
