#include "widget.h"
#include<QPushButton>   //由于要创建按钮需要用到按钮类QPushButton,故需要包含与该类同名的头文件

Widget::Widget(QWidget *parent): QWidget(parent) //派生类只能通过参数列表的形式来调用基类的构造函数
{
      QPushButton *btn1 = new QPushButton;  //创建一个按钮
      btn1->show();  //调用show后会单独弹出一个独立的窗口，show是以顶层方式弹出窗口控件
      //要想让btn这个窗口贴在用户自定义窗口类Widget所定义的窗口中必须对btn设置贴在哪一个窗口上
      btn1->setParent(this); /*setparent()这个函数的形参是Qwidget所定义的一个对象的指针，可以利用
      派生类的对象的地址为其赋值，在这里用用户自定义窗口类Widget当前对象的地址，即this指针指向了当前对象
      ，表示这个窗口是贴在用户自定义的窗口上的（这样用户就可以自定义自己想要的窗口了）   */

      btn1->setText("第一个按钮");   //为按钮中设置内容（显示文本）

      QPushButton *btn2 = new QPushButton("第二个按钮",this); /*可以在创建按钮时直接指明参数调用
      相应的构造函数来为这个按钮进行初始化（使用这种方法创建的窗口不用调用show()函数就可以自动显示在窗口上，
      因为在相应的构造函数时已经为这个按钮指明了贴在this这个窗口上）。
      注意：对这个按钮单独赋值或者创建时传参调用相应的构造函数为其赋值所创建的窗口的大小和按钮位置不一样  */
      btn2->move(100,100);  //设置按钮2所显示位置的坐标

      setWindowTitle("第一个窗口");   //设置窗口的标题，即是设置窗口左上角的文字
      resize(600,400);       //设置窗口的大小（指的是显示的默认窗口大小，但是用户可以利用鼠标进行缩放）

      setFixedSize(600,400);   //设置固定的窗口大小（用户不可以利用鼠标进行缩放）

 /* 总：(1)在用户自定义窗口类的源文件（就是用户窗口类名.cpp这个文件）中进行窗口的设置。
       (2)在这个源文件中不是通过对象所调用的函数，如上面的setWindowTitle()、resize()、setFixedSize()等，
          是用来设置窗口的，是对窗口所进行的操作；在这个源文件中通过对象调用的函数，如上面的btn2->move()、
          btn1->show()是用来对某一个对象进行操作的，即是对某一个按钮的设置；如果想要使这个对象贴在这个窗口
          上，必须对这个对象指明其所贴的窗口，this指针指向了这个窗口，利用btn1->setParent(this)就可以使
          这个对象贴在这个窗口上了，另一种方法是在创建对象时指明参数this就会在创建时使这个对象贴在这个窗口上
          了。
        (3)注意，以上的函数都是在用户自定义窗口类的默认构造函数里面写的，即用户在创建一个窗口时会自动去执行这
          些函数，从而完成窗口的设置，即实现的是用用户自定义窗口类定义的对象的是用户自定义的窗口。
          如果不再用户自定义窗口类的构造函数里面写则不会自动去执行这些函数，需要用户通过窗口类的对象调用去
          实现。

 */
}

Widget::~Widget()
{
    //delete ui;
}

